In [2]:
file="income.csv"
import pandas as pd
df=pd.read_csv(file)
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [3]:
df[["2010"]] # to get columns values in 2010

    2010
0  40933
1  57848
2  46896
3  38587
4  54283

In [4]:
# to print the the sum of values in the column
s=0                      
for i in df["2010"]:
    s=s+i
print(s)

238547

In [5]:
# to get the particular elements of row
df.loc[1]

GEOID    04000US02
State       Alaska
2005         55891
2006         56418
2007         62993
2008         63989
2009         61604
2010         57848
2011         57431
2012         63648
2013         61137
Name: 1, dtype: object

In [6]:
# to find the sum of elements in a row
df.iloc[1,2:]

2005    55891
2006    56418
2007    62993
2008    63989
2009    61604
2010    57848
2011    57431
2012    63648
2013    61137
Name: 1, dtype: object

In [7]:
s=0                      
for i in df.iloc[1,2:]:
    s=s+i
print(s)

540959

In [8]:
df["2010"].sum()  # sum of columns by using method

238547

In [9]:
# to get  4t row and all columns
df.iloc[4,2:]

2005    51755
2006    55319
2007    55734
2008    57014
2009    56134
2010    54283
2011    53367
2012    57020
2013    57528
Name: 4, dtype: object

In [10]:
# 4t row and all columns sum
df.iloc[4,2:].sum()

498154

In [11]:
# 2006 t0 2008  to get columns
df.iloc[:,2:6]

    2005   2006   2007   2008
0  37150  37952  42212  44476
1  55891  56418  62993  63989
2  45245  46657  62993  46914
3  36658  37057  40795  39586
4  51755  55319  55734  57014

In [12]:
# to get 2006 t0 2008 all columns sum
df.iloc[:,2:6].sum()

2005    226699
2006    233403
2007    264727
2008    251979
dtype: int64

In [13]:
a=df[["2005","2006","2007","2008"]].sum()
a.sum()

976808

In [14]:
# to get all columns sum
a=df.iloc[0:,2:].sum()
a.sum()

2199422

In [15]:
df.sum() # to find the total sum of all columns of individual columns

GEOID    04000US0104000US0204000US0404000US0504000US06
State           AlabamaAlaskaArizonaArkansasCalifornia
2005                                            226699
2006                                            233403
2007                                            264727
2008                                            251979
2009                                            239995
2010                                            238547
2011                                            243311
2012                                            250194
2013                                            250567
dtype: object

In [16]:
#  to find the total sum of all rows of individual rows
df.sum(1)

0    370138
1    540959
2    440711
3    349460
4    498154
dtype: int64

In [17]:
df.prod()

2005    2304332586102593708
2006   -3396487475510719616
2007   -6999381839592754296
2008   -6111060772352250592
2009    6209617939067354560
2010    1185894860788790400
2011    4814774946528885700
2012    1466460077803167744
2013    3670165461116089616
dtype: int64

In [18]:
# to find product of 1 nd 2 rows nd up to 2008
a=df.iloc[1:2,2:6].prod().prod()
a

-5736403676770409890

In [19]:
help(df.iloc)

Help on _iLocIndexer in module pandas.core.indexing object:

class _iLocIndexer(_LocationIndexer)
 |  Purely integer-location based indexing for selection by position.
 |
 |  ``.iloc[]`` is primarily integer position based (from ``0`` to
 |  ``length-1`` of the axis), but may also be used with a boolean
 |  array.
 |
 |  Allowed inputs are:
 |
 |  - An integer, e.g. ``5``.
 |  - A list or array of integers, e.g. ``[4, 3, 0]``.
 |  - A slice object with ints, e.g. ``1:7``.
 |  - A boolean array.
 |  - A ``callable`` function with one argument (the calling Series, DataFrame
 |    or Panel) and that returns valid output for indexing (one of the above).
 |    This is useful in method chains, when you don't have a reference to the
 |    calling object, but would like to base your selection on some value.
 |
 |  ``.iloc`` will raise ``IndexError`` if a requested indexer is
 |  out-of-bounds, except *slice* indexers which allow out-of-bounds
 |  indexing (this conforms with python/numpy *slice* semantics).
 |
 |  See more at ref:`Selection by Position <indexing.integer>`.
 |
 |  See Also
 |  --------
 |  DataFrame.iat : Fast integer location scalar accessor.
 |  DataFrame.loc : Purely label-location based indexer for selection by label.
 |  Series.iloc : Purely integer-location based indexing for
 |                 selection by position.
 |
 |  Examples
 |  --------
 |
 |  >>> mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
 |  ...           {'a': 100, 'b': 200, 'c': 300, 'd': 400},
 |  ...           {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]
 |  >>> df = pd.DataFrame(mydict)
 |  >>> df
 |        a     b     c     d
 |  0     1     2     3     4
 |  1   100   200   300   400
 |  2  1000  2000  3000  4000
 |
 |  **Indexing just the rows**
 |
 |  With a scalar integer.
 |
 |  >>> type(df.iloc[0])
 |  <class 'pandas.core.series.Series'>
 |  >>> df.iloc[0]
 |  a    1
 |  b    2
 |  c    3
 |  d    4
 |  Name: 0, dtype: int64
 |
 |  With a list of integers.
 |
 |  >>> df.iloc[[0]]
 |     a  b  c  d
 |  0  1  2  3  4
 |  >>> type(df.iloc[[0]])
 |  <class 'pandas.core.frame.DataFrame'>
 |
 |  >>> df.iloc[[0, 1]]
 |       a    b    c    d
 |  0    1    2    3    4
 |  1  100  200  300  400
 |
 |  With a `slice` object.
 |
 |  >>> df.iloc[:3]
 |        a     b     c     d
 |  0     1     2     3     4
 |  1   100   200   300   400
 |  2  1000  2000  3000  4000
 |
 |  With a boolean mask the same length as the index.
 |
 |  >>> df.iloc[[True, False, True]]
 |        a     b     c     d
 |  0     1     2     3     4
 |  2  1000  2000  3000  4000
 |
 |  With a callable, useful in method chains. The `x` passed
 |  to the ``lambda`` is the DataFrame being sliced. This selects
 |  the rows whose index label even.
 |
 |  >>> df.iloc[lambda x: x.index % 2 == 0]
 |        a     b     c     d
 |  0     1     2     3     4
 |  2  1000  2000  3000  4000
 |
 |  **Indexing both axes**
 |
 |  You can mix the indexer types for the index and columns. Use ``:`` to
 |  select the entire axis.
 |
 |  With scalar integers.
 |
 |  >>> df.iloc[0, 1]
 |  2
 |
 |  With lists of integers.
 |
 |  >>> df.iloc[[0, 2], [1, 3]]
 |        b     d
 |  0     2     4
 |  2  2000  4000
 |
 |  With `slice` objects.
 |
 |  >>> df.iloc[1:3, 0:3]
 |        a     b     c
 |  1   100   200   300
 |  2  1000  2000  3000
 |
 |  With a boolean array whose length matches the columns.
 |
 |  >>> df.iloc[:, [True, False, True, False]]
 |        a     c
 |  0     1     3
 |  1   100   300
 |  2  1000  3000
 |
 |  With a callable function that expects the Series or DataFrame.
 |
 |  >>> df.iloc[:, lambda df: [0, 2]]
 |        a     c
 |  0     1     3
 |  1   100   300
 |  2  1000  3000
 |
 |  Method resolution order:
 |      _iLocIndexer
 |      _LocationIndexer
 |      _NDFrameIndexer
 |      pandas._libs.indexing._NDFrameIndexerBase
 |      builtins.object
 |
 |  Methods inherited from _LocationIndexer:
 |
 |  __getitem__(self, key)
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from _NDFrameIndexer:
 |
 |  __call__(self, axis=None)
 |      Call self as a function.
 |
 |  __iter__(self)
 |
 |  __setitem__(self, key, value)
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from _NDFrameIndexer:
 |
 |  __dict__
 |      dictionary for instance variables (if defined)
 |
 |  __weakref__
 |      list of weak references to the object (if defined)
 |
 |  ----------------------------------------------------------------------
 |  Data and other attributes inherited from _NDFrameIndexer:
 |
 |  axis = None
 |
 |  ----------------------------------------------------------------------
 |  Methods inherited from pandas._libs.indexing._NDFrameIndexerBase:
 |
 |  __init__(self, /, *args, **kwargs)
 |      Initialize self.  See help(type(self)) for accurate signature.
 |
 |  __reduce__ = __reduce_cython__(...)
 |
 |  __setstate__ = __setstate_cython__(...)
 |
 |  ----------------------------------------------------------------------
 |  Static methods inherited from pandas._libs.indexing._NDFrameIndexerBase:
 |
 |  __new__(*args, **kwargs) from builtins.type
 |      Create and return a new object.  See help(type) for accurate signature.
 |
 |  ----------------------------------------------------------------------
 |  Data descriptors inherited from pandas._libs.indexing._NDFrameIndexerBase:
 |
 |  name
 |
 |  ndim
 |
 |  obj

In [20]:
# to find average use mean()
# find the avg of 2011 column
df["2011"].mean()

48662.2

In [21]:
# to find the avg of 2nd row
df.iloc[1,2:].mean()

60106.555555555555

In [22]:
##median
# find the median of 2011 column
df["2011"].median()

48621.0

In [23]:
# to find the mediAN of 2nd row
df.iloc[1,2:].median()

61137.0

In [25]:
# Combined Average Income of all states from 2005 to 2013
a=df.iloc[0:,2:].mean() # mean(1)=r0w wise avg
a.mean()                #mean(0)=column wise avg

48876.044444444444

In [28]:
# State with highest average income in the last three years
a=max(df["2011"])
a

57431

In [30]:
df[df["2011"]==a]

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137

In [35]:
df1=pd.read_csv(file,index_col="State")
df1

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013
State,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [36]:
df
#df.head(4)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [37]:
df["2011"]==max(df["2011"])

0    False
1     True
2    False
3    False
4    False
Name: 2011, dtype: bool

# State with highest average income in the last three years

In [42]:
df1.iloc[:,-3:]  # values of last 3 years

             2011   2012   2013
State
Alabama     42590  43464  41381
Alaska      57431  63648  61137
Arizona     48621  47044  50602
Arkansas    41302  39018  39919
California  53367  57020  57528

In [43]:
df1.iloc[:,-3:].mean(1) # row wise avg of last 3 years

State
Alabama       42478.333333
Alaska        60738.666667
Arizona       48755.666667
Arkansas      40079.666667
California    55971.666667
dtype: float64

In [49]:
df1["last three years"]=df1.iloc[:,-3:].mean(1)  ## adding anew column
df1

,GEOID,2005,2006,2007,2008,2009,2010,2011,2012,2013,last three years
State,,,,,,,,,,,
Alabama,04000US01,37150,37952,42212,44476,39980,40933,42590,43464,41381,42441.111111
Alaska,04000US02,55891,56418,62993,63989,61604,57848,57431,63648,61137,61841.222222
Arizona,04000US04,45245,46657,62993,46914,45739,46896,48621,47044,50602,48800.555556
Arkansas,04000US05,36658,37057,40795,39586,36538,38587,41302,39018,39919,39672.222222
California,04000US06,51755,55319,55734,57014,56134,54283,53367,57020,57528,56839.888889

In [50]:
df1["last three years"]==max(df1["last three years"])   ## boolean masking

State
Alabama       False
Alaska         True
Arizona       False
Arkansas      False
California    False
Name: last three years, dtype: bool

In [53]:
df1[df1["last three years"]==max(df1["last three years"])].index[0]  # to get one state from the above data

'Alaska'

In [54]:
df1.iloc[:,-3:].mean(1).idxmax()

'Alaska'

## State with lowest average income from 2007 to 2010(inclusive)

In [58]:
df1.iloc[:,4:8] ## printing the columns from 2007 to 2010

             2008   2009   2010   2011
State
Alabama     44476  39980  40933  42590
Alaska      63989  61604  57848  57431
Arizona     46914  45739  46896  48621
Arkansas    39586  36538  38587  41302
California  57014  56134  54283  53367

In [57]:
## lowest average income from 2007 to 2010(inclusive)
df1.iloc[:,4:8].mean(1).idxmin()

'Arkansas'

## Print the list of all states in the same line with average income less than California

In [59]:
df1.iloc[:,2:].mean(1)

State
Alabama       41714.345679
Alaska        60767.691358
Arizona       49362.950617
Arkansas      39163.802469
California    55915.432099
dtype: float64

In [65]:
## mean of calfornia
calavg=df1.iloc[-1,2:].mean()
calavg

55915.43209876543

In [79]:
list(df1[df1.iloc[:,2:].mean(1)<calavg].index)

['Alabama', 'Arizona', 'Arkansas']

## Print the names of states based on descending order of income in the year 2009

In [69]:
a=df1.iloc[:,6]
a

State
Alabama       40933
Alaska        57848
Arizona       46896
Arkansas      38587
California    54283
Name: 2010, dtype: int64

In [71]:
b=a.sort_values(ascending=False)
b

State
Alaska        57848
California    54283
Arizona       46896
Alabama       40933
Arkansas      38587
Name: 2010, dtype: int64

In [72]:
list(b.index)

['Alaska', 'California', 'Arizona', 'Alabama', 'Arkansas']

## State with the lowest recorded income from 2005 to 2013'''

In [78]:
df1.iloc[:,2:11].idxmin()

2006                Arkansas
2007                Arkansas
2008                Arkansas
2009                Arkansas
2010                Arkansas
2011                Arkansas
2012                Arkansas
2013                Arkansas
last three years    Arkansas
dtype: object